#+BEGIN_EXPORT html
<style>
  /* Existing CSS for alternating row colors */
  tr:nth-child(even) {
    background-color: #f2f2f2;
  }

  /* Right-align all table cells by default */
  td {
    text-align: right;
  }

  /* Left-align the first table cell */
  td:first-child {
    text-align: left !important;
  }

  /* Right-align all table headers by default */
  th {
    text-align: right;
  }

  /* Left-align the first table header */
  th:first-child {
    text-align: left !important;
  }
</style>

<script>
  document.addEventListener("DOMContentLoaded", function() {
    const tables = document.querySelectorAll("table");

    tables.forEach(table => {
      const headerRow = table.querySelector("tr");
      const columnHeader = headerRow ? headerRow.querySelectorAll("th")[1] : null;
      const isLatencyTable = columnHeader && columnHeader.textContent.includes("latency");

      const rows = table.querySelectorAll("tr");
      rows.forEach((row, index) => {
	if(index === 0) return;

	const cells = row.querySelectorAll("td");
	if(cells.length === 0) return;

	const percentageCell = cells[2];
	const percentage = parseFloat(percentageCell.textContent.trim());

	let baseColor, gradientColor;
	if (isLatencyTable) {
	  baseColor = percentage >= 0 ? 'rgba(255, 200, 200, 0.6)' : 'rgba(200, 255, 200, 0.6)';
	  gradientColor = percentage >= 0 ? 'rgba(255, 0, 0, 1)' : 'rgba(0, 255, 0, 1)';
	} else {
	  baseColor = percentage >= 0 ? 'rgba(200, 255, 200, 0.6)' : 'rgba(255, 200, 200, 0.6)';
	  gradientColor = percentage >= 0 ? 'rgba(0, 255, 0, 1)' : 'rgba(255, 0, 0, 1)';
	}

	const magnitude = Math.abs(percentage);
	const gradient = `linear-gradient(to left, ${gradientColor} 0%, ${gradientColor} ${magnitude}%, ${baseColor} ${magnitude}%, ${baseColor} 100%)`;

	percentageCell.style.background = gradient;
      });
    });
  });
</script>

#+END_EXPORT
* Requests/s
** http
| Release                                 | request/s (x1000) | % Diff from 4.13.8 |
|-----------------------------------------+-------------------+--------------------|
| 4.13.8                                  |             82233 |               0.00 |
| 4.13.8 haproxy-2.6                      |             82819 |               0.71 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |             71854 |             -12.62 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |             72538 |             -11.79 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** edge
| Release                                 | request/s (x1000) | % Diff from 4.13.8 |
|-----------------------------------------+-------------------+--------------------|
| 4.13.8                                  |             57876 |               0.00 |
| 4.13.8 haproxy-2.6                      |             57860 |              -0.03 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |             58312 |               0.75 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |             57935 |               0.10 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** reencrypt
| Release                                 | reencrypt/s (x1000) | % Diff from 4.13.8 |
|-----------------------------------------+---------------------+--------------------|
| 4.13.8                                  |               60956 |               0.00 |
| 4.13.8 haproxy-2.6                      |               57007 |              -6.48 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |               58751 |              -3.62 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |               59777 |              -1.93 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** passthrough
| Release                                 | request/s (x1000) | % Diff from 4.13.8 |
|-----------------------------------------+-------------------+--------------------|
| 4.13.8                                  |             76726 |               0.00 |
| 4.13.8 haproxy-2.6                      |            105219 |              37.14 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |             76527 |              -0.26 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |             75127 |              -2.08 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

* Latency
** edge
| Release                                 | latency (ms) | % Diff from 4.13.8 |
|-----------------------------------------+--------------+--------------------|
| 4.13.8                                  |           60 |               0.00 |
| 4.13.8 haproxy-2.6                      |           62 |               3.33 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |           63 |               5.00 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |           62 |               3.33 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** http
| Release                                 | latency (ms) | % Diff from 4.13.8 |
|-----------------------------------------+--------------+--------------------|
| 4.13.8                                  |           43 |               0.00 |
| 4.13.8 haproxy 2.6                      |           44 |               2.33 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |           50 |              16.28 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |           47 |               9.30 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** reencrypt
| Release                                 | latency (ms) | % Diff from 4.13.8 |
|-----------------------------------------+--------------+--------------------|
| 4.13.8                                  |           54 |               0.00 |
| 4.13.8 haproxy-2.6                      |           84 |              55.56 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |           75 |              38.89 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |           49 |              -9.26 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

** passthrough
| Release                                 | latency (ms) | % Diff from 4.13.8 |
|-----------------------------------------+--------------+--------------------|
| 4.13.8                                  |            7 |               0.00 |
| 4.13.8 haproxy-2.6                      |            4 |             -42.86 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.6 |            4 |             -42.86 |
| 4.14.0-0.nightly-2023-09-02 haproxy-2.2 |            8 |              14.29 |
#+TBLFM: $3=(($2 - @2$2) / @2$2) * 100;%.2f

* Cluster Sizing
#+BEGIN_SRC text
"masterNodesType": "m5.8xlarge",
"workerNodesType": "m5.2xlarge",
"masterNodesCount": 3,
"infraNodesType": "r5.2xlarge",
"workerNodesCount": 24,
"infraNodesCount": 3,
"otherNodesCount": 0,
"totalNodes": 30,
"sdnType": "OVNKubernetes",
#+END_SRC

